Revit 2026 API

# UVAdd Method

---

Adds the specified 2-D vector to this 2-D vector and returns the result.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public UV Add(
	UV source
)
```
```vb
Public Function Add (
	source As UV
) As UV
```
```cpp
public:
UV^ Add(
	UV^ source
)
```
```fsharp
member Add :
        source : UV -> UV
```

#### Parameters

source UV
    The vector to add to this vector.

#### Return Value

UVThe 2-D vector equal to the sum of the two vectors.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when source is . |

The added vector is obtained by adding each coordinate of the specified vector to the corresponding coordinate of this vector.

#### Reference

UV Class

Autodesk.Revit.DB Namespace